[
  {
    "id": "rule_priorite_droite",
    "topic": "Priority",
    "title_fr": "Priorité à droite",
    "title_en": "Priority to the right",
    "fr": "À une intersection sans panneau ni marquage, vous devez céder le passage aux véhicules venant de votre droite.",
    "en": "At an intersection with no signs or markings, you must give way to vehicles coming from your right.",
    "tip": "If nothing is shown, assume priority to the right in many urban cases.",
    "example_fr": "Vous arrivez à une petite rue. Pas de panneau. Une voiture arrive à droite. Vous ralentissez et vous la laissez passer.",
    "example_en": "You reach a small street. No sign. A car approaches from the right. You slow down and let it pass.",
    "example_tip": "Look for road markings. A yield line overrides priority to the right.",
    "tags": ["priority", "intersection"],
    "keywords": ["priorité à droite", "intersection", "céder"]
  },
  {
    "id": "rule_stop_vs_cedez",
    "topic": "Priority",
    "title_fr": "STOP vs CÉDEZ LE PASSAGE",
    "title_en": "STOP vs GIVE WAY",
    "fr": "STOP: arrêt complet obligatoire. CÉDEZ: vous ralentissez et vous vous arrêtez seulement si nécessaire.",
    "en": "STOP: full stop required. GIVE WAY: slow down and stop only if necessary.",
    "tip": "Many questions test full stop at STOP.",
    "example_fr": "Si la voie est libre à un Cédez, vous pouvez passer sans vous arrêter.",
    "example_en": "If the road is clear at Give Way, you may pass without stopping.",
    "example_tip": "At STOP, you stop even if the road is empty.",
    "tags": ["priority", "intersection"],
    "keywords": ["stop", "cédez", "passage"]
  },
  {
    "id": "rule_speed_agglomeration",
    "topic": "Speed",
    "title_fr": "Vitesse en agglomération",
    "title_en": "Speed in built up areas",
    "fr": "En agglomération, la vitesse maximale est souvent 50 km/h, sauf indication différente. Adaptez selon la visibilité et les usagers.",
    "en": "In built up areas, the maximum speed is often 50 km/h unless signs indicate otherwise. Adapt to visibility and road users.",
    "tip": "Even if 50 is allowed, you reduce near schools, crossings, or congestion.",
    "example_fr": "Rue étroite avec piétons. Vous roulez bien en dessous de 50.",
    "example_en": "Narrow street with pedestrians. You drive well below 50.",
    "example_tip": "Exam expects adaptation, not only the limit.",
    "tags": ["speed"],
    "keywords": ["agglomération", "50", "vitesse"]
  },
  {
    "id": "rule_distance_securite",
    "topic": "Distance",
    "title_fr": "Distance de sécurité",
    "title_en": "Safety distance",
    "fr": "Vous gardez une distance suffisante pour freiner sans collision si le véhicule devant ralentit. La distance augmente avec la vitesse et la pluie.",
    "en": "Keep enough distance to brake without collision if the vehicle ahead slows down. Distance increases with speed and rain.",
    "tip": "Use a time gap approach in questions. Example: two seconds in good conditions.",
    "example_fr": "Vous choisissez un repère. La voiture devant passe. Vous comptez. Si vous arrivez trop vite, vous augmentez la distance.",
    "example_en": "Pick a reference point. The car ahead passes. You count. If you reach too soon, increase distance.",
    "example_tip": "Rain and fog require more time gap.",
    "tags": ["speed", "distance"],
    "keywords": ["distance", "sécurité", "freinage"]
  },
  {
    "id": "rule_ligne_continue",
    "topic": "Markings",
    "title_fr": "Ligne continue",
    "title_en": "Solid line",
    "fr": "Vous ne devez pas franchir une ligne continue. Vous ne dépassez pas et vous ne changez pas de voie en la franchissant.",
    "en": "You must not cross a solid line. No overtaking and no lane change across it.",
    "tip": "Questions often show solid line near bends or hills where visibility is low.",
    "example_fr": "Vous êtes derrière un véhicule lent. Ligne continue. Vous patientez.",
    "example_en": "You are behind a slow vehicle. Solid line. You wait.",
    "example_tip": "Crossing a solid line is a common exam error.",
    "tags": ["markings", "overtake", "signage"],
    "keywords": ["ligne continue", "franchir", "dépassement"]
  },
  {
    "id": "rule_stationnement_vs_arret",
    "topic": "Parking",
    "title_fr": "Arrêt vs stationnement",
    "title_en": "Stopping vs parking",
    "fr": "Arrêt: immobilisation brève pour faire monter ou descendre un passager, le conducteur reste prêt à repartir. Stationnement: immobilisation plus longue ou conducteur absent.",
    "en": "Stopping: short stop to pick up or drop off, driver remains ready to move. Parking: longer stop or driver is away from the vehicle.",
    "tip": "No parking sign does not always mean no stopping.",
    "example_fr": "Vous vous arrêtez 20 secondes pour déposer un passager. Vous restez au volant. C’est un arrêt.",
    "example_en": "You stop for 20 seconds to drop a passenger. You stay in the driver seat. This is stopping.",
    "example_tip": "If driver leaves the seat, it becomes parking.",
    "tags": ["parking"],
    "keywords": ["arrêt", "stationnement", "interdit"]
  },
  {
"id": "rule_rond_point_entree",
"topic": "Priority",
"title_fr": "Entrée dans un rond point",
"title_en": "Entering a roundabout",
"fr": "Vous respectez la signalisation à l’entrée. Le plus souvent, vous cédez le passage aux véhicules déjà engagés.",
"en": "Follow entry signs and markings. Most often, you give way to vehicles already on the roundabout.",
"tip": "Look for Give Way sign and yield line at the entry.",
"example_fr": "Je ralentis, je regarde à gauche, je m’insère si la voie est libre.",
"example_en": "I slow down, look left, and merge when clear.",
"example_tip": "Signal with indicators before changing lane or exiting.",
"tags": ["priority", "intersection"],
"keywords": ["rond-point", "giratoire", "cédez"]
},
{
"id": "rule_clignotant_rond_point",
"topic": "Lights",
"title_fr": "Clignotants au rond point",
"title_en": "Indicators at a roundabout",
"fr": "Vous mettez le clignotant à droite pour sortir. Pour aller à gauche ou faire demi tour, vous signalez à gauche puis à droite avant de sortir.",
"en": "Use right indicator to exit. For left or U turn, signal left then switch to right before exiting.",
"tip": "Exam checks correct signalling. Especially when exiting.",
"example_fr": "Je prends la troisième sortie. Je mets à gauche. Puis à droite après la sortie précédente.",
"example_en": "I take the third exit. I signal left, then right after the previous exit.",
"example_tip": "Always check mirrors before changing lane on the roundabout.",
"tags": ["lights", "intersection"],
"keywords": ["clignotant", "rond-point", "sortie"]
},
{
"id": "rule_feu_orange",
"topic": "Lights",
"title_fr": "Feu orange",
"title_en": "Amber light",
"fr": "Au feu orange fixe, vous devez vous arrêter, sauf si l’arrêt crée un danger ou si vous êtes trop proche.",
"en": "At a steady amber light, you must stop unless stopping would be unsafe or you are too close.",
"tip": "Not an invitation to accelerate. It is a stop signal with a safety exception.",
"example_fr": "Je suis loin du feu. J’anticipe et je m’arrête.",
"example_en": "I am far from the light. I anticipate and stop.",
"example_tip": "If you decide to go, it must be clearly safer than stopping.",
"tags": ["lights"],
"keywords": ["orange", "feu", "arrêt"]
},
{
"id": "rule_feu_clignotant_orange",
"topic": "Lights",
"title_fr": "Feu orange clignotant",
"title_en": "Flashing amber light",
"fr": "Vous pouvez passer. Vous devez redoubler de prudence et respecter les priorités et la signalisation.",
"en": "You may proceed. You must be extra cautious and follow priority rules and signs.",
"tip": "Treat as an intersection with rules, not as a green light.",
"example_fr": "Je ralentis et je vérifie l’intersection avant de m’engager.",
"example_en": "I slow down and check the intersection before entering.",
"example_tip": "Pedestrians and cross traffic become key risks.",
"tags": ["lights", "intersection"],
"keywords": ["clignotant", "orange", "prudence"]
},
{
"id": "rule_depassement_conditions",
"topic": "Overtaking",
"title_fr": "Conditions pour dépasser",
"title_en": "Conditions to overtake",
"fr": "Vous dépassez seulement si la visibilité est suffisante, si la manœuvre est autorisée, et si vous pouvez revenir sans gêner.",
"en": "Overtake only with enough visibility, when permitted, and when you can return without forcing others to brake.",
"tip": "Exam focuses on visibility, markings, and presence of intersections.",
"example_fr": "Je contrôle rétroviseurs et angle mort. Je signale. Je dépasse. Je me rabats avec marge.",
"example_en": "I check mirrors and blind spot. I signal. I pass. I return with space.",
"example_tip": "If unsure, do not overtake.",
"tags": ["overtake"],
"keywords": ["dépassement", "visibilité", "rabattre"]
},
{
"id": "rule_passage_pieton_priorite",
"topic": "Priority",
"title_fr": "Priorité des piétons",
"title_en": "Pedestrian priority",
"fr": "Vous devez céder le passage au piéton engagé sur le passage piétons. Vous ralentissez si un piéton manifeste l’intention de traverser.",
"en": "You must give way to a pedestrian already crossing. Slow down if a pedestrian clearly intends to cross.",
"tip": "Exam expects anticipation near crossings and schools.",
"example_fr": "Je vois un piéton au bord du passage. Je ralentis et je suis prêt à m’arrêter.",
"example_en": "I see a pedestrian at the crossing edge. I slow and prepare to stop.",
"example_tip": "Never overtake a vehicle stopped at a crossing.",
"tags": ["priority", "signage"],
"keywords": ["piéton", "passage", "priorité"]
},
{
"id": "rule_stationnement_intersections",
"topic": "Parking",
"title_fr": "Stationnement près des intersections",
"title_en": "Parking near intersections",
"fr": "Vous évitez de stationner près des intersections et des passages piétons. La règle vise à préserver la visibilité.",
"en": "Avoid parking near intersections and pedestrian crossings. The goal is to keep visibility.",
"tip": "Questions often show reduced visibility as the key reason.",
"example_fr": "Je ne stationne pas à l’angle d’une rue, je cherche une zone dégagée.",
"example_en": "I do not park at a street corner. I choose a clear area.",
"example_tip": "Visibility problems create faults and accidents.",
"tags": ["parking", "intersection"],
"keywords": ["stationnement", "intersection", "visibilité"]
},
{
"id": "rule_vitesse_pluie",
"topic": "Speed",
"title_fr": "Adapter la vitesse sous la pluie",
"title_en": "Adapting speed in rain",
"fr": "Sous la pluie, l’adhérence diminue et la distance de freinage augmente. Vous réduisez la vitesse et augmentez la distance.",
"en": "In rain, grip decreases and braking distance increases. Reduce speed and increase following distance.",
"tip": "Exam expects a lower speed even if the posted limit stays unchanged.",
"example_fr": "Je garde plus de distance et j’évite les manœuvres brusques.",
"example_en": "I keep more distance and avoid abrupt maneuvers.",
"example_tip": "Risk increases near puddles and painted markings.",
"tags": ["speed", "distance"],
"keywords": ["pluie", "adhérence", "freinage"]
},
{
"id": "rule_zone_30",
"topic": "Speed",
"title_fr": "Règles en zone 30",
"title_en": "Rules in Zone 30",
"fr": "En zone 30, vous roulez à 30 km/h maximum. Vous anticipez la présence de piétons et de cyclistes.",
"en": "In a Zone 30, maximum speed is 30 km/h. Anticipate pedestrians and cyclists.",
"tip": "Zone signs apply until the end of zone sign. Not only for the next street.",
"example_fr": "Je ralentis avant les passages piétons et je reste prêt à freiner.",
"example_en": "I slow before crossings and stay ready to brake.",
"example_tip": "Adaptation matters more than driving at the maximum.",
"tags": ["speed"],
"keywords": ["zone 30", "vitesse", "piétons"]
},
{
"id": "rule_sens_unique",
"topic": "Markings",
"title_fr": "Conduite en sens unique",
"title_en": "Driving on a one way street",
"fr": "En sens unique, vous respectez la signalisation et les voies. Vous pouvez utiliser la voie la plus adaptée, selon marquage et direction.",
"en": "On a one way street, follow signs and lanes. Use the appropriate lane based on markings and direction.",
"tip": "Watch for bikes and bus lanes. They can have exceptions.",
"example_fr": "Pour tourner à gauche, je me place à gauche si le marquage le permet.",
"example_en": "To turn left, I position to the left if markings allow.",
"example_tip": "Check mirrors and blind spots for two wheelers.",
"tags": ["signage", "intersection"],
"keywords": ["sens unique", "voie", "placement"]
},
  {
"id": "rule_priorite_bus",
"topic": "Priority",
"title_fr": "Priorité des bus",
"title_en": "Bus priority",
"fr": "En agglomération, les bus peuvent être prioritaires lorsqu’ils quittent un arrêt si la signalisation l’indique.",
"en": "In built up areas, buses may have priority when leaving a stop if signs indicate it.",
"tip": "Look for a specific sign or road marking.",
"example_fr": "Je ralentis pour laisser repartir le bus.",
"example_en": "I slow down to let the bus pull out.",
"example_tip": "Not automatic priority. Only if indicated.",
"tags": ["priority"],
"keywords": ["bus", "priorité", "arrêt"]
},
{
"id": "rule_insertion_voie_acceleration",
"topic": "Priority",
"title_fr": "Insertion sur voie d’accélération",
"title_en": "Merging from acceleration lane",
"fr": "Vous utilisez la voie d’accélération pour atteindre la vitesse et vous vous insérez sans gêner les véhicules déjà sur la voie.",
"en": "Use the acceleration lane to reach speed and merge without forcing vehicles already on the road to slow.",
"tip": "Priority stays with vehicles already on the road.",
"example_fr": "J’accélère puis je m’insère quand l’espace est suffisant.",
"example_en": "I accelerate then merge when the gap is sufficient.",
"example_tip": "Do not stop at the end of the lane unless unavoidable.",
"tags": ["priority", "speed"],
"keywords": ["insertion", "accélération", "autoroute"]
},
{
"id": "rule_changement_voie",
"topic": "Markings",
"title_fr": "Changement de voie",
"title_en": "Changing lanes",
"fr": "Avant de changer de voie, vous contrôlez rétroviseurs, angle mort et vous signalez votre intention.",
"en": "Before changing lanes, check mirrors, blind spot, and signal your intention.",
"tip": "Priority stays with the lane already occupied.",
"example_fr": "Je vérifie l’angle mort avant de me déporter.",
"example_en": "I check the blind spot before moving over.",
"example_tip": "Lane change faults are common in exams.",
"tags": ["signage"],
"keywords": ["changement", "voie", "clignotant"]
},
{
"id": "rule_distance_lateral",
"topic": "Overtaking",
"title_fr": "Distance latérale de sécurité",
"title_en": "Lateral safety distance",
"fr": "Vous laissez une distance latérale suffisante lors du dépassement, surtout avec les cyclistes et piétons.",
"en": "Leave enough side distance when overtaking, especially cyclists and pedestrians.",
"tip": "At least one meter in town. More outside town.",
"example_fr": "Je dépasse le cycliste avec une large marge.",
"example_en": "I overtake the cyclist with a wide gap.",
"example_tip": "Close overtaking is heavily penalized.",
"tags": ["overtake"],
"keywords": ["distance", "latérale", "cycliste"]
},
{
"id": "rule_depassement_intersections",
"topic": "Overtaking",
"title_fr": "Dépassement aux intersections",
"title_en": "Overtaking near intersections",
"fr": "Le dépassement est interdit à proximité des intersections sauf indication contraire.",
"en": "Overtaking is forbidden near intersections unless signs allow it.",
"tip": "Visibility and crossing traffic are the risk.",
"example_fr": "Je patiente avant le carrefour.",
"example_en": "I wait before the junction.",
"example_tip": "Solid lines reinforce the rule.",
"tags": ["overtake", "intersection"],
"keywords": ["dépassement", "intersection"]
},
{
"id": "rule_arret_bus_scolaire",
"topic": "Priority",
"title_fr": "Arrêt de bus scolaire",
"title_en": "School bus stop",
"fr": "À l’arrêt d’un bus scolaire, vous redoublez de prudence en raison des enfants pouvant traverser.",
"en": "At a school bus stop, be extra cautious due to children crossing.",
"tip": "Children behavior is unpredictable.",
"example_fr": "Je ralentis fortement à l’approche.",
"example_en": "I slow down significantly when approaching.",
"example_tip": "Anticipation is evaluated.",
"tags": ["priority"],
"keywords": ["bus", "scolaire", "enfants"]
},
{
"id": "rule_stationnement_trottoir",
"topic": "Parking",
"title_fr": "Stationnement sur trottoir",
"title_en": "Parking on sidewalk",
"fr": "Le stationnement sur le trottoir est interdit sauf autorisation explicite par marquage ou panneau.",
"en": "Parking on the sidewalk is forbidden unless explicitly authorized by signs or markings.",
"tip": "Sidewalk belongs to pedestrians.",
"example_fr": "Je ne stationne pas sur le trottoir.",
"example_en": "I do not park on the sidewalk.",
"example_tip": "Common trap in urban questions.",
"tags": ["parking"],
"keywords": ["stationnement", "trottoir"]
},
{
"id": "rule_stationnement_double_file",
"topic": "Parking",
"title_fr": "Stationnement en double file",
"title_en": "Double parking",
"fr": "Le stationnement en double file est interdit car il gêne la circulation.",
"en": "Double parking is forbidden because it obstructs traffic.",
"tip": "Even short absence counts as parking.",
"example_fr": "Je cherche une place autorisée.",
"example_en": "I look for an authorized space.",
"example_tip": "Stopping differs from parking only if driver stays ready.",
"tags": ["parking"],
"keywords": ["double file", "stationnement"]
},
{
"id": "rule_feux_pietons",
"topic": "Lights",
"title_fr": "Feux piétons",
"title_en": "Pedestrian lights",
"fr": "Les feux piétons régulent la traversée. Vous cédez le passage au piéton engagé même si votre feu est vert.",
"en": "Pedestrian lights control crossings. Give way to pedestrians already crossing even if your light is green.",
"tip": "Green light does not cancel pedestrian safety.",
"example_fr": "Je laisse finir la traversée.",
"example_en": "I let the pedestrian finish crossing.",
"example_tip": "Never rush through crossings.",
"tags": ["lights", "priority"],
"keywords": ["feux", "piétons"]
},
{
"id": "rule_feu_rouge",
"topic": "Lights",
"title_fr": "Feu rouge",
"title_en": "Red light",
"fr": "Au feu rouge, vous devez vous arrêter avant la ligne d’effet du feu.",
"en": "At a red light, you must stop before the stop line.",
"tip": "Crossing on red is a major fault.",
"example_fr": "Je m’arrête avant la ligne.",
"example_en": "I stop before the line.",
"example_tip": "Turning right on red is forbidden unless sign allows it.",
"tags": ["lights"],
"keywords": ["rouge", "feu", "arrêt"]
},
{
"id": "rule_visibilite_brouillard",
"topic": "Speed",
"title_fr": "Conduite par brouillard",
"title_en": "Driving in fog",
"fr": "Par brouillard, vous adaptez la vitesse, allumez les feux appropriés et augmentez la distance.",
"en": "In fog, adapt speed, use appropriate lights, and increase distance.",
"tip": "Fog lights have specific usage rules.",
"example_fr": "Je réduis fortement la vitesse.",
"example_en": "I significantly reduce speed.",
"example_tip": "Visibility distance drives speed choice.",
"tags": ["speed", "distance"],
"keywords": ["brouillard", "visibilité"]
},
{
"id": "rule_feux_brouillard",
"topic": "Lights",
"title_fr": "Feux de brouillard",
"title_en": "Fog lights",
"fr": "Les feux de brouillard avant ou arrière sont utilisés en cas de forte pluie, neige ou brouillard.",
"en": "Fog lights are used in heavy rain, snow, or fog.",
"tip": "Rear fog light forbidden in normal rain.",
"example_fr": "J’éteins le feu arrière dès que la visibilité s’améliore.",
"example_en": "I turn off the rear fog light when visibility improves.",
"example_tip": "Misuse leads to faults.",
"tags": ["lights"],
"keywords": ["brouillard", "feux"]
},
{
"id": "rule_utilisation_klaxon",
"topic": "Signage",
"title_fr": "Utilisation du klaxon",
"title_en": "Use of the horn",
"fr": "Le klaxon sert à avertir d’un danger immédiat. Son usage abusif est interdit.",
"en": "The horn is used to warn of immediate danger. Excessive use is forbidden.",
"tip": "Not a communication tool.",
"example_fr": "Je klaxonne pour éviter un danger.",
"example_en": "I use the horn to avoid danger.",
"example_tip": "Silence required in urban areas at night.",
"tags": ["signage"],
"keywords": ["klaxon", "avertisseur"]
}
]
