[
  {
    "id": "rule_priorite_droite",
    "topic": "Priority",
    "title_fr": "Priorité à droite",
    "title_en": "Priority to the right",
    "fr": "À une intersection sans panneau ni marquage, vous devez céder le passage aux véhicules venant de votre droite.",
    "en": "At an intersection with no signs or markings, you must give way to vehicles coming from your right.",
    "tip": "If nothing is shown, assume priority to the right in many urban cases.",
    "example_fr": "Vous arrivez à une petite rue. Pas de panneau. Une voiture arrive à droite. Vous ralentissez et vous la laissez passer.",
    "example_en": "You reach a small street. No sign. A car approaches from the right. You slow down and let it pass.",
    "example_tip": "Look for road markings. A yield line overrides priority to the right.",
    "tags": ["priority", "intersection"],
    "keywords": ["priorité à droite", "intersection", "céder"]
  },
  {
    "id": "rule_stop_vs_cedez",
    "topic": "Priority",
    "title_fr": "STOP vs CÉDEZ LE PASSAGE",
    "title_en": "STOP vs GIVE WAY",
    "fr": "STOP: arrêt complet obligatoire. CÉDEZ: vous ralentissez et vous vous arrêtez seulement si nécessaire.",
    "en": "STOP: full stop required. GIVE WAY: slow down and stop only if necessary.",
    "tip": "Many questions test full stop at STOP.",
    "example_fr": "Si la voie est libre à un Cédez, vous pouvez passer sans vous arrêter.",
    "example_en": "If the road is clear at Give Way, you may pass without stopping.",
    "example_tip": "At STOP, you stop even if the road is empty.",
    "tags": ["priority", "intersection"],
    "keywords": ["stop", "cédez", "passage"]
  },
  {
    "id": "rule_speed_agglomeration",
    "topic": "Speed",
    "title_fr": "Vitesse en agglomération",
    "title_en": "Speed in built up areas",
    "fr": "En agglomération, la vitesse maximale est souvent 50 km/h, sauf indication différente. Adaptez selon la visibilité et les usagers.",
    "en": "In built up areas, the maximum speed is often 50 km/h unless signs indicate otherwise. Adapt to visibility and road users.",
    "tip": "Even if 50 is allowed, you reduce near schools, crossings, or congestion.",
    "example_fr": "Rue étroite avec piétons. Vous roulez bien en dessous de 50.",
    "example_en": "Narrow street with pedestrians. You drive well below 50.",
    "example_tip": "Exam expects adaptation, not only the limit.",
    "tags": ["speed"],
    "keywords": ["agglomération", "50", "vitesse"]
  },
  {
    "id": "rule_distance_securite",
    "topic": "Distance",
    "title_fr": "Distance de sécurité",
    "title_en": "Safety distance",
    "fr": "Vous gardez une distance suffisante pour freiner sans collision si le véhicule devant ralentit. La distance augmente avec la vitesse et la pluie.",
    "en": "Keep enough distance to brake without collision if the vehicle ahead slows down. Distance increases with speed and rain.",
    "tip": "Use a time gap approach in questions. Example: two seconds in good conditions.",
    "example_fr": "Vous choisissez un repère. La voiture devant passe. Vous comptez. Si vous arrivez trop vite, vous augmentez la distance.",
    "example_en": "Pick a reference point. The car ahead passes. You count. If you reach too soon, increase distance.",
    "example_tip": "Rain and fog require more time gap.",
    "tags": ["speed", "distance"],
    "keywords": ["distance", "sécurité", "freinage"]
  },
  {
    "id": "rule_ligne_continue",
    "topic": "Markings",
    "title_fr": "Ligne continue",
    "title_en": "Solid line",
    "fr": "Vous ne devez pas franchir une ligne continue. Vous ne dépassez pas et vous ne changez pas de voie en la franchissant.",
    "en": "You must not cross a solid line. No overtaking and no lane change across it.",
    "tip": "Questions often show solid line near bends or hills where visibility is low.",
    "example_fr": "Vous êtes derrière un véhicule lent. Ligne continue. Vous patientez.",
    "example_en": "You are behind a slow vehicle. Solid line. You wait.",
    "example_tip": "Crossing a solid line is a common exam error.",
    "tags": ["markings", "overtake", "signage"],
    "keywords": ["ligne continue", "franchir", "dépassement"]
  },
  {
    "id": "rule_stationnement_vs_arret",
    "topic": "Parking",
    "title_fr": "Arrêt vs stationnement",
    "title_en": "Stopping vs parking",
    "fr": "Arrêt: immobilisation brève pour faire monter ou descendre un passager, le conducteur reste prêt à repartir. Stationnement: immobilisation plus longue ou conducteur absent.",
    "en": "Stopping: short stop to pick up or drop off, driver remains ready to move. Parking: longer stop or driver is away from the vehicle.",
    "tip": "No parking sign does not always mean no stopping.",
    "example_fr": "Vous vous arrêtez 20 secondes pour déposer un passager. Vous restez au volant. C’est un arrêt.",
    "example_en": "You stop for 20 seconds to drop a passenger. You stay in the driver seat. This is stopping.",
    "example_tip": "If driver leaves the seat, it becomes parking.",
    "tags": ["parking"],
    "keywords": ["arrêt", "stationnement", "interdit"]
  }
]
